#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rdcresume/resume-backend/runs/run-aCsD5MipbCoAGn4e

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.archive_file.zip_python_code: Refreshing...
data.archive_file.zip_python_code: Refresh complete after 0s [id=a8293125d4dc8d08250d56061e5a166be7bc6786]
random_pet.sg: Refreshing state... [id=destined-chipmunk]
aws_iam_policy.BasicLambdaPolicy: Refreshing state... [id=arn:aws:iam::721647388262:policy/BasicLambdaPolicy]
aws_iam_policy.VisitCountTotalAccess: Refreshing state... [id=arn:aws:iam::721647388262:policy/VisitorCountTotalAccess]
aws_iam_role.lambda_role: Refreshing state... [id=terraform_aws_lambda_role]
aws_dynamodb_table.basic-dynamodb-table: Refreshing state... [id=VisitCountTotal]
aws_dynamodb_table_item.VisitCountTotal: Refreshing state... [id=VisitCountTotal|visitor_id||visitor_counter|]
aws_iam_role_policy_attachment.attachment["arn:aws:iam::721647388262:policy/VisitorCountTotalAccess"]: Refreshing state... [id=terraform_aws_lambda_role-20230511195945503200000001]
aws_iam_role_policy_attachment.attachment["arn:aws:iam::721647388262:policy/BasicLambdaPolicy"]: Refreshing state... [id=terraform_aws_lambda_role-20230511195945556500000002]
aws_lambda_function.visitorFunc: Refreshing state... [id=visitorFunc]
aws_lambda_function.visitorFunc: Drift detected (update)
aws_iam_role.lambda_role: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833"
        }
    }

  # aws_api_gateway_integration.GETintegration will be created
  + resource "aws_api_gateway_integration" "GETintegration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:721647388262:function:visitorFunc/invocations"
    }

  # aws_api_gateway_integration.POSTintegration will be created
  + resource "aws_api_gateway_integration" "POSTintegration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:721647388262:function:visitorFunc/invocations"
    }

  # aws_api_gateway_method.GETMethod will be created
  + resource "aws_api_gateway_method" "GETMethod" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.POSTMethod will be created
  + resource "aws_api_gateway_method" "POSTMethod" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.callVisitorFuncResource will be created
  + resource "aws_api_gateway_resource" "callVisitorFuncResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "callVisitorFunc"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.callVisitorFunc will be created
  + resource "aws_api_gateway_rest_api" "callVisitorFunc" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "callVisitorFunc"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "visitorFunc"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowcallVisitorFuncInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @RyanChris95, Action: `pull_request`*